#### Terraform Plan: ✅

<details>
<summary>Show</summary>

```terraform
[command]/home/runner/work/_temp/b36fa722-2aad-48b9-9fa2-774c098f388d/terraform-bin plan -input=false
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/tnfhhm-dev/runs/run-R8xme4xmx1uHfLj5

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

random_integer.cf_origin_id: Refreshing state... [id=43]
data.aws_security_group.web: Refreshing state... [id=sg-077ca2fe1ed399078]
module.network.data.aws_security_group.data: Refreshing state... [id=sg-068812412c1f4bea9]
module.network.data.aws_security_group.web: Refreshing state... [id=sg-077ca2fe1ed399078]
module.network.data.aws_security_group.app: Refreshing state... [id=sg-03895fdd9a15adf6e]
data.aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:loadbalancer/app/default/beefd40ca18daea4]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster]
aws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic]
aws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]
aws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]
aws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E23CKPYGN5GJ1C]
module.network.data.aws_vpc.main: Refreshing state... [id=vpc-018906cab60cf165b]
data.aws_iam_policy_document.ecs_task_execution_role: Refreshing state... [id=320642683]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]
aws_budgets_budget.cost: Refreshing state... [id=813318847992:startup-sample-monthly]
data.aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/default/beefd40ca18daea4/5b2c7f29cb605a49]
module.network.data.aws_subnet_ids.web: Refreshing state... [id=vpc-018906cab60cf165b]
module.network.data.aws_subnet_ids.app: Refreshing state... [id=vpc-018906cab60cf165b]
module.network.data.aws_subnet_ids.data: Refreshing state... [id=vpc-018906cab60cf165b]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0e956b97159d4aefd]
aws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/b9f03c2e861e332a]
aws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]
aws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]
module.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Refreshing state... [id=subnet-0a663db91e3d61619]
module.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Refreshing state... [id=subnet-0d0e52f2aabe9cd5d]
module.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Refreshing state... [id=subnet-048e25be105ae01d3]
module.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Refreshing state... [id=subnet-0896ff158c3ecdc53]
module.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Refreshing state... [id=subnet-0077fd92d83bfff33]
module.network.data.aws_subnet.web["subnet-089c577af80110363"]: Refreshing state... [id=subnet-089c577af80110363]
aws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]
aws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20210223210605247400000001]
aws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener-rule/app/default/beefd40ca18daea4/5b2c7f29cb605a49/4e727caeb3f8311a]
aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service]
aws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]
aws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]
aws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]
aws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]
aws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_budgets_budget.cost will be updated in-place
  ~ resource "aws_budgets_budget" "cost" {
        account_id        = "813318847992"
        arn               = "arn:aws:budgets::813318847992:budget/startup-sample-monthly"
        budget_type       = "COST"
        cost_filters      = {
            "TagKeyValue" = "user:Project$Startup Sample"
        }
        id                = "813318847992:startup-sample-monthly"
        limit_amount      = "100.0"
        limit_unit        = "USD"
        name              = "startup-sample-monthly"
        time_period_end   = "2087-06-15_00:00"
      ~ time_period_start = "2021-10-01_12:00" -> (known after apply)
        time_unit         = "MONTHLY"

        cost_filter {
            name   = "TagKeyValue"
            values = [
                "user:Project$Startup Sample",
            ]
        }

        cost_types {
            include_credit             = true
            include_discount           = true
            include_other_subscription = true
            include_recurring          = true
            include_refund             = true
            include_subscription       = true
            include_support            = true
            include_tax                = true
            include_upfront            = true
            use_amortized              = false
            use_blended                = false
        }

        notification {
            comparison_operator        = "GREATER_THAN"
            notification_type          = "FORECASTED"
            subscriber_email_addresses = []
            subscriber_sns_topic_arns  = [
                "arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic",
            ]
            threshold                  = 75
            threshold_type             = "PERCENTAGE"
        }
    }

  # aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        cluster                            = "arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster"
        deployment_maximum_percent         = 200
        deployment_minimum_healthy_percent = 100
      ~ desired_count                      = 1 -> 2
        enable_ecs_managed_tags            = true
        enable_execute_command             = false
        health_check_grace_period_seconds  = 60
        iam_role                           = "aws-service-role"
        id                                 = "arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service"
        name                               = "sample-service"
        platform_version                   = "LATEST"
        propagate_tags                     = "TASK_DEFINITION"
        scheduling_strategy                = "REPLICA"
        tags                               = {
            "Application" = "Startup Sample"
        }
        tags_all                           = {
            "Application" = "Startup Sample"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:86" -> (known after apply)
        wait_for_steady_state              = false

        capacity_provider_strategy {
            base              = 0
            capacity_provider = "FARGATE_SPOT"
            weight            = 100
        }

        deployment_circuit_breaker {
            enable   = false
            rollback = false
        }

        deployment_controller {
            type = "ECS"
        }

        load_balancer {
            container_name   = "sample-client-app"
            container_port   = 80
            target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/b9f03c2e861e332a"
        }

        network_configuration {
            assign_public_ip = false
            security_groups  = [
                "sg-0e956b97159d4aefd",
            ]
            subnets          = [
                "subnet-048e25be105ae01d3",
                "subnet-0896ff158c3ecdc53",
            ]
        }
    }

  # aws_ecs_task_definition.app[0] must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:86" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                    cpu              = 512
                    environment      = [
                        {
                            name  = "AWS_REGION"
                            value = "ca-central-1"
                        },
                        {
                            name  = "DB_NAME"
                            value = "ssp-greetings"
                        },
                    ]
                    essential        = true
                  ~ image            = "016328607553.dkr.ecr.ca-central-1.amazonaws.com/ssp:82c69febe89a46d8f2559f0e8372381eab534390" -> "016328607553.dkr.ecr.ca-central-1.amazonaws.com/ssp:3b87f7e4945930aac82d3c46b5674d384487b13c"
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-create-group  = "true"
                            awslogs-group         = "/ecs/sample-app"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "ecs"
                        }
                    }
                    memory           = 1024
                    mountPoints      = []
                    name             = "sample-client-app"
                    portMappings     = [
                        {
                            containerPort = 80
                            hostPort      = 80
                            protocol      = "tcp"
                        },
                    ]
                    volumesFrom      = []
                } # forces replacement,
            ]
        )
        cpu                      = "512"
        execution_role_arn       = "arn:aws:iam::813318847992:role/startupSampleEcsTaskExecutionRole"
        family                   = "sample-app-task"
      ~ id                       = "sample-app-task" -> (known after apply)
        memory                   = "1024"
        network_mode             = "awsvpc"
        requires_compatibilities = [
            "FARGATE",
        ]
      ~ revision                 = 86 -> (known after apply)
        tags                     = {
            "Application" = "Startup Sample"
        }
        tags_all                 = {
            "Application" = "Startup Sample"
        }
        task_role_arn            = "arn:aws:iam::813318847992:role/sample_app_container_role"
    }

Plan: 1 to add, 2 to change, 1 to destroy.

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.180320000000000144/mo +$0.0
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/tnfhhm-dev/runs/run-R8xme4xmx1uHfLj5%0A%0AWaiting for the plan to start...%0A%0ATerraform v0.13.5%0AConfiguring remote state backend...%0AInitializing Terraform configuration...%0ARefreshing Terraform state in-memory prior to plan...%0AThe refreshed state will be used to calculate this plan, but will not be%0Apersisted to local or remote state storage.%0A%0Arandom_integer.cf_origin_id: Refreshing state... [id=43]%0Adata.aws_security_group.web: Refreshing state... [id=sg-077ca2fe1ed399078]%0Amodule.network.data.aws_security_group.data: Refreshing state... [id=sg-068812412c1f4bea9]%0Amodule.network.data.aws_security_group.web: Refreshing state... [id=sg-077ca2fe1ed399078]%0Amodule.network.data.aws_security_group.app: Refreshing state... [id=sg-03895fdd9a15adf6e]%0Adata.aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:loadbalancer/app/default/beefd40ca18daea4]%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic]%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E23CKPYGN5GJ1C]%0Amodule.network.data.aws_vpc.main: Refreshing state... [id=vpc-018906cab60cf165b]%0Adata.aws_iam_policy_document.ecs_task_execution_role: Refreshing state... [id=320642683]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Aaws_budgets_budget.cost: Refreshing state... [id=813318847992:startup-sample-monthly]%0Adata.aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/default/beefd40ca18daea4/5b2c7f29cb605a49]%0Amodule.network.data.aws_subnet_ids.web: Refreshing state... [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet_ids.app: Refreshing state... [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet_ids.data: Refreshing state... [id=vpc-018906cab60cf165b]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-0e956b97159d4aefd]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/b9f03c2e861e332a]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Amodule.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Refreshing state... [id=subnet-0a663db91e3d61619]%0Amodule.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Refreshing state... [id=subnet-0d0e52f2aabe9cd5d]%0Amodule.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Refreshing state... [id=subnet-048e25be105ae01d3]%0Amodule.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Refreshing state... [id=subnet-0896ff158c3ecdc53]%0Amodule.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Refreshing state... [id=subnet-0077fd92d83bfff33]%0Amodule.network.data.aws_subnet.web["subnet-089c577af80110363"]: Refreshing state... [id=subnet-089c577af80110363]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20210223210605247400000001]%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener-rule/app/default/beefd40ca18daea4/5b2c7f29cb605a49/4e727caeb3f8311a]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0A%0A------------------------------------------------------------------------%0A%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        account_id        = "813318847992"%0A        arn               = "arn:aws:budgets::813318847992:budget/startup-sample-monthly"%0A        budget_type       = "COST"%0A        cost_filters      = {%0A            "TagKeyValue" = "user:Project$Startup Sample"%0A        }%0A        id                = "813318847992:startup-sample-monthly"%0A        limit_amount      = "100.0"%0A        limit_unit        = "USD"%0A        name              = "startup-sample-monthly"%0A        time_period_end   = "2087-06-15_00:00"%0A      ~ time_period_start = "2021-10-01_12:00" -> (known after apply)%0A        time_unit         = "MONTHLY"%0A%0A        cost_filter {%0A            name   = "TagKeyValue"%0A            values = [%0A                "user:Project$Startup Sample",%0A            ]%0A        }%0A%0A        cost_types {%0A            include_credit             = true%0A            include_discount           = true%0A            include_other_subscription = true%0A            include_recurring          = true%0A            include_refund             = true%0A            include_subscription       = true%0A            include_support            = true%0A            include_tax                = true%0A            include_upfront            = true%0A            use_amortized              = false%0A            use_blended                = false%0A        }%0A%0A        notification {%0A            comparison_operator        = "GREATER_THAN"%0A            notification_type          = "FORECASTED"%0A            subscriber_email_addresses = []%0A            subscriber_sns_topic_arns  = [%0A                "arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic",%0A            ]%0A            threshold                  = 75%0A            threshold_type             = "PERCENTAGE"%0A        }%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A        cluster                            = "arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster"%0A        deployment_maximum_percent         = 200%0A        deployment_minimum_healthy_percent = 100%0A      ~ desired_count                      = 1 -> 2%0A        enable_ecs_managed_tags            = true%0A        enable_execute_command             = false%0A        health_check_grace_period_seconds  = 60%0A        iam_role                           = "aws-service-role"%0A        id                                 = "arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        platform_version                   = "LATEST"%0A        propagate_tags                     = "TASK_DEFINITION"%0A        scheduling_strategy                = "REPLICA"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A        tags_all                           = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:86" -> (known after apply)%0A        wait_for_steady_state              = false%0A%0A        capacity_provider_strategy {%0A            base              = 0%0A            capacity_provider = "FARGATE_SPOT"%0A            weight            = 100%0A        }%0A%0A        deployment_circuit_breaker {%0A            enable   = false%0A            rollback = false%0A        }%0A%0A        deployment_controller {%0A            type = "ECS"%0A        }%0A%0A        load_balancer {%0A            container_name   = "sample-client-app"%0A            container_port   = 80%0A            target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/b9f03c2e861e332a"%0A        }%0A%0A        network_configuration {%0A            assign_public_ip = false%0A            security_groups  = [%0A                "sg-0e956b97159d4aefd",%0A            ]%0A            subnets          = [%0A                "subnet-048e25be105ae01d3",%0A                "subnet-0896ff158c3ecdc53",%0A            ]%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:86" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                    cpu              = 512%0A                    environment      = [%0A                        {%0A                            name  = "AWS_REGION"%0A                            value = "ca-central-1"%0A                        },%0A                        {%0A                            name  = "DB_NAME"%0A                            value = "ssp-greetings"%0A                        },%0A                    ]%0A                    essential        = true%0A                  ~ image            = "016328607553.dkr.ecr.ca-central-1.amazonaws.com/ssp:82c69febe89a46d8f2559f0e8372381eab534390" -> "016328607553.dkr.ecr.ca-central-1.amazonaws.com/ssp:3b87f7e4945930aac82d3c46b5674d384487b13c"%0A                    logConfiguration = {%0A                        logDriver = "awslogs"%0A                        options   = {%0A                            awslogs-create-group  = "true"%0A                            awslogs-group         = "/ecs/sample-app"%0A                            awslogs-region        = "ca-central-1"%0A                            awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                    memory           = 1024%0A                    mountPoints      = []%0A                    name             = "sample-client-app"%0A                    portMappings     = [%0A                        {%0A                            containerPort = 80%0A                            hostPort      = 80%0A                            protocol      = "tcp"%0A                        },%0A                    ]%0A                    volumesFrom      = []%0A                } # forces replacement,%0A            ]%0A        )%0A        cpu                      = "512"%0A        execution_role_arn       = "arn:aws:iam::813318847992:role/startupSampleEcsTaskExecutionRole"%0A        family                   = "sample-app-task"%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A        memory                   = "1024"%0A        network_mode             = "awsvpc"%0A        requires_compatibilities = [%0A            "FARGATE",%0A        ]%0A      ~ revision                 = 86 -> (known after apply)%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        tags_all                 = {%0A            "Application" = "Startup Sample"%0A        }%0A        task_role_arn            = "arn:aws:iam::813318847992:role/sample_app_container_role"%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.180320000000000144/mo +$0.0%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/tnfhhm-dev/runs/run-R8xme4xmx1uHfLj5%0A%0AWaiting for the plan to start...%0A%0ATerraform v0.13.5%0AConfiguring remote state backend...%0AInitializing Terraform configuration...%0ARefreshing Terraform state in-memory prior to plan...%0AThe refreshed state will be used to calculate this plan, but will not be%0Apersisted to local or remote state storage.%0A%0Arandom_integer.cf_origin_id: Refreshing state... [id=43]%0Adata.aws_security_group.web: Refreshing state... [id=sg-077ca2fe1ed399078]%0Amodule.network.data.aws_security_group.data: Refreshing state... [id=sg-068812412c1f4bea9]%0Amodule.network.data.aws_security_group.web: Refreshing state... [id=sg-077ca2fe1ed399078]%0Amodule.network.data.aws_security_group.app: Refreshing state... [id=sg-03895fdd9a15adf6e]%0Adata.aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:loadbalancer/app/default/beefd40ca18daea4]%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic]%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E23CKPYGN5GJ1C]%0Amodule.network.data.aws_vpc.main: Refreshing state... [id=vpc-018906cab60cf165b]%0Adata.aws_iam_policy_document.ecs_task_execution_role: Refreshing state... [id=320642683]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Aaws_budgets_budget.cost: Refreshing state... [id=813318847992:startup-sample-monthly]%0Adata.aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/default/beefd40ca18daea4/5b2c7f29cb605a49]%0Amodule.network.data.aws_subnet_ids.web: Refreshing state... [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet_ids.app: Refreshing state... [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnet_ids.data: Refreshing state... [id=vpc-018906cab60cf165b]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-0e956b97159d4aefd]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/b9f03c2e861e332a]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Amodule.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Refreshing state... [id=subnet-0a663db91e3d61619]%0Amodule.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Refreshing state... [id=subnet-0d0e52f2aabe9cd5d]%0Amodule.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Refreshing state... [id=subnet-048e25be105ae01d3]%0Amodule.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Refreshing state... [id=subnet-0896ff158c3ecdc53]%0Amodule.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Refreshing state... [id=subnet-0077fd92d83bfff33]%0Amodule.network.data.aws_subnet.web["subnet-089c577af80110363"]: Refreshing state... [id=subnet-089c577af80110363]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20210223210605247400000001]%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener-rule/app/default/beefd40ca18daea4/5b2c7f29cb605a49/4e727caeb3f8311a]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0A%0A------------------------------------------------------------------------%0A%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        account_id        = "813318847992"%0A        arn               = "arn:aws:budgets::813318847992:budget/startup-sample-monthly"%0A        budget_type       = "COST"%0A        cost_filters      = {%0A            "TagKeyValue" = "user:Project$Startup Sample"%0A        }%0A        id                = "813318847992:startup-sample-monthly"%0A        limit_amount      = "100.0"%0A        limit_unit        = "USD"%0A        name              = "startup-sample-monthly"%0A        time_period_end   = "2087-06-15_00:00"%0A      ~ time_period_start = "2021-10-01_12:00" -> (known after apply)%0A        time_unit         = "MONTHLY"%0A%0A        cost_filter {%0A            name   = "TagKeyValue"%0A            values = [%0A                "user:Project$Startup Sample",%0A            ]%0A        }%0A%0A        cost_types {%0A            include_credit             = true%0A            include_discount           = true%0A            include_other_subscription = true%0A            include_recurring          = true%0A            include_refund             = true%0A            include_subscription       = true%0A            include_support            = true%0A            include_tax                = true%0A            include_upfront            = true%0A            use_amortized              = false%0A            use_blended                = false%0A        }%0A%0A        notification {%0A            comparison_operator        = "GREATER_THAN"%0A            notification_type          = "FORECASTED"%0A            subscriber_email_addresses = []%0A            subscriber_sns_topic_arns  = [%0A                "arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic",%0A            ]%0A            threshold                  = 75%0A            threshold_type             = "PERCENTAGE"%0A        }%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A        cluster                            = "arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster"%0A        deployment_maximum_percent         = 200%0A        deployment_minimum_healthy_percent = 100%0A      ~ desired_count                      = 1 -> 2%0A        enable_ecs_managed_tags            = true%0A        enable_execute_command             = false%0A        health_check_grace_period_seconds  = 60%0A        iam_role                           = "aws-service-role"%0A        id                                 = "arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        platform_version                   = "LATEST"%0A        propagate_tags                     = "TASK_DEFINITION"%0A        scheduling_strategy                = "REPLICA"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A        tags_all                           = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:86" -> (known after apply)%0A        wait_for_steady_state              = false%0A%0A        capacity_provider_strategy {%0A            base              = 0%0A            capacity_provider = "FARGATE_SPOT"%0A            weight            = 100%0A        }%0A%0A        deployment_circuit_breaker {%0A            enable   = false%0A            rollback = false%0A        }%0A%0A        deployment_controller {%0A            type = "ECS"%0A        }%0A%0A        load_balancer {%0A            container_name   = "sample-client-app"%0A            container_port   = 80%0A            target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/b9f03c2e861e332a"%0A        }%0A%0A        network_configuration {%0A            assign_public_ip = false%0A            security_groups  = [%0A                "sg-0e956b97159d4aefd",%0A            ]%0A            subnets          = [%0A                "subnet-048e25be105ae01d3",%0A                "subnet-0896ff158c3ecdc53",%0A            ]%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:86" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                    cpu              = 512%0A                    environment      = [%0A                        {%0A                            name  = "AWS_REGION"%0A                            value = "ca-central-1"%0A                        },%0A                        {%0A                            name  = "DB_NAME"%0A                            value = "ssp-greetings"%0A                        },%0A                    ]%0A                    essential        = true%0A                  ~ image            = "016328607553.dkr.ecr.ca-central-1.amazonaws.com/ssp:82c69febe89a46d8f2559f0e8372381eab534390" -> "016328607553.dkr.ecr.ca-central-1.amazonaws.com/ssp:3b87f7e4945930aac82d3c46b5674d384487b13c"%0A                    logConfiguration = {%0A                        logDriver = "awslogs"%0A                        options   = {%0A                            awslogs-create-group  = "true"%0A                            awslogs-group         = "/ecs/sample-app"%0A                            awslogs-region        = "ca-central-1"%0A                            awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                    memory           = 1024%0A                    mountPoints      = []%0A                    name             = "sample-client-app"%0A                    portMappings     = [%0A                        {%0A                            containerPort = 80%0A                            hostPort      = 80%0A                            protocol      = "tcp"%0A                        },%0A                    ]%0A                    volumesFrom      = []%0A                } # forces replacement,%0A            ]%0A        )%0A        cpu                      = "512"%0A        execution_role_arn       = "arn:aws:iam::813318847992:role/startupSampleEcsTaskExecutionRole"%0A        family                   = "sample-app-task"%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A        memory                   = "1024"%0A        network_mode             = "awsvpc"%0A        requires_compatibilities = [%0A            "FARGATE",%0A        ]%0A      ~ revision                 = 86 -> (known after apply)%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        tags_all                 = {%0A            "Application" = "Startup Sample"%0A        }%0A        task_role_arn            = "arn:aws:iam::813318847992:role/sample_app_container_role"%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.180320000000000144/mo +$0.0%0A
::set-output name=stderr::
::set-output name=exitcode::0

```

</details>

#### Architecture Diagram

![img](https://i.ibb.co/C7XL89P/inframap.png)

*Pusher:* @dependabot[bot], *Action:* [Terraform Plan: #35](https://github.com/bcgov/startup-sample-project-aws-containers/actions/runs/1660232198)